Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh11-v3.tmx
Source language: bo
Languages: en

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། གཟུགས་རྣམས་དངོས་པོ་དང་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving sights as entities and non-entities?”

source: སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་པ་དང་། ཆོས་རྣམས་དངོས་པོ་དང་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving sounds, odors, tastes, tangibles, and mental phenomena as entities and non-entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མིག་གི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་དངོས་པོ་དང་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the sensory element of the eyes, the sensory element of sights, and the sensory element of visual consciousness as entities and non-entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། རྣ་བའི་ཁམས་དང་། སྒྲའི་ཁམས་དང་། རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་དངོས་པོ་དང་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the sensory element of the ears, the sensory element of sounds, and the sensory element of auditory consciousness as entities and non-entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། སྣའི་ཁམས་དང་། དྲིའི་ཁམས་དང་། སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་དངོས་པོ་དང་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the sensory element of the nose, the sensory element of odors, and the sensory element of olfactory consciousness as entities and non-entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། ལྕེའི་ཁམས་དང་། རོའི་ཁམས་དང་། ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་དངོས་པོ་དང་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the sensory element of the tongue, the sensory element of tastes, and the sensory element of gustatory consciousness as entities and non-entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། ལུས་ཀྱི་ཁམས་དང་། རེག་བྱའི་ཁམས་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་དངོས་པོ་དང་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the sensory element of the body, the sensory element of tangibles, and the sensory element of tactile consciousness as entities and non-entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། ཡིད་ཀྱི་ཁམས་དང་། ཆོས་ཀྱི་ཁམས་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་དངོས་པོ་དང་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the sensory element of the mental faculty, the sensory element of mental phenomena, and the sensory element of mental consciousness as entities and non-entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། འཕགས་པའི་བདེན་པ་རྣམས་དང་། རྒ་ཤིའི་བར་དུ་དངོས་པོ་དང་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the noble truths, and similarly [all other phenomenological categories], up to and including the [dependent link of] aging and death, as entities and non-entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་དུ་དངོས་པོ་དང་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the four applications of mindfulness, and in the same vein, [all the other causal attributes], up to and including the noble eightfold path, as entities and non-entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། རྣམ་པར་ཐར་པའི་སྒོ་རྣམས་དང་དེ་བཞིན་དུ་སྦྱར་ཏེ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་དངོས་པོ་དང་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། གསོལ་པ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the gateways to liberation, and in the same vein, [all the other attainments], up to and including the emptiness of the essential nature of non-entities, as entities and non-entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་དངོས་པོ་དང་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the ten powers of the tathāgatas, and in the same vein, [all the other fruitional attributes], up to and including omniscience, as entities and non-entities?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུའི་བར་དུ་དངོས་པོ་དང་དངོས་པོ་མེད་པར་མཐོང་བས་རྣམ་པར་གྲོལ་སྙམ་འམ། །གསོལ་པ།
en: “Śāradvatī­putra, do you think that one is liberated by perceiving the six transcendent perfections, and in the same vein, [all the other fruitional attributes], up to and including the eighty minor marks, as entities and non-entities?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: he replied.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤ་ར་དྭ་ཏིའི་བུ་ཁྱོད་དོན་གྱི་དབང་གང་མཐོང་ན་འདི་སྐད་དུ་གཟུགས་དང་རྣམ་པར་ཤེས་པའི་བར་དུ་དངོས་པོར་མཐོང་བས་ཀྱང་རྣམ་པར་མི་གྲོལ་ལ།
en: Thereupon, the Blessed One addressed the venerable Śāradvatī­putra as follows: “Whatever your reasoning, one is not liberated by perceiving physical forms, [and all the other aggregates], up to and including consciousness, as entities.

source: དངོས་པོ་མེད་པར་མཐོང་བས་ཀྱང་མ་ཡིན་ཞིང་། དངོས་པོ་དང་དངོས་པོ་མེད་པར་མཐོང་བས་ཀྱང་མ་ཡིན་ནོ། །
en: Nor is one liberated by perceiving them as non-entities, and nor is one liberated by perceiving them as entities and non-entities.

source: དེ་བཞིན་དུ་མིག་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། ཡིད་ཀྱི་བར་དང་། དེ་བཞིན་དུ་གཟུགས་རྣམས་དང་།
en: Likewise, this applies to the eyes, and in the same vein, to [all the other sense organs], up to and including the mental faculty.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ་ཆོས་རྣམས་ཀྱི་བར་དང་།
en: Likewise it applies to sights, and in the same vein, to [all the other sense objects], up to and including mental phenomena.

source: དེ་བཞིན་དུ་མིག་གི་ཁམས་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་བར་དང་།
en: Likewise, it applies to the sensory element of the eyes, and, in the same vein, to [all the other sensory elements], up to and including the sensory element of mental consciousness.

source: དེ་བཞིན་དུ་འཕགས་པའི་བདེན་པ་རྣམས་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། རྒ་ཤིའི་བར་དང་།
en: Likewise, it applies to the noble truths and, in the same vein, [to all other phenomena], up to and including [the dependent link] of aging and death.

source: དེ་བཞིན་དུ་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་དང་།
en: Likewise, it applies to the applications of mindfulness and, in the same vein, [to the other causal attributes], up to and including the noble eightfold path.

source: དེ་བཞིན་དུ་རྣམ་པར་ཐར་པའི་སྒོ་རྣམས་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དག་དང་།
en: Likewise, it applies to the gateways to liberation and, in the same vein, [to all the other attainments], up to and including the emptiness of the essential nature of non-entities.

source: དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དང་།
en: Likewise, it applies to the powers of the tathāgatas and, in the same vein, [to all the other fruitional attributes], up to and including omniscience.

source: དེ་བཞིན་དུ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: Likewise, it applies to the six transcendent perfections and, in the same vein, [to all the other fruitional attributes], up to and including the eighty minor marks.

source: དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུའི་བར་དག་དངོས་པོར་མཐོང་བས་ཀྱང་རྣམ་པར་མི་གྲོལ་ལ།
en: “In all these cases, one is not liberated by perceiving them as entities.

source: དངོས་པོ་མེད་པར་མཐོང་བས་ཀྱང་མ་ཡིན་ཞིང་། དངོས་པོ་དང་དངོས་པོ་མེད་པར་མཐོང་བས་ཀྱང་རྣམ་པར་མི་གྲོལ།
en: Nor is one liberated by perceiving them as non-entities, and nor is one liberated by perceiving them as entities and non-entities.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། ཇི་ལྟར་གཟུགས་ཀྱི་ཕུང་པོར་བསྟན་པ་བཞིན་དུ་ཐམས་ཅད་དུ་རྒྱས་པར་བྱའོ། །ཞེས་སྨྲ། དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: In the same vein, this should be extended to cover the entire range of phenomena, just as has been presented here with reference to the aggregate of physical forms [and so forth].”

source: བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་འདི་ལྟར་གཟུགས་མ་མཆིས་ཤིང་མི་དམིགས་ལགས་ན། གཟུགས་དངོས་པོར་མཐོང་བའམ། དངོས་པོ་མ་མཆིས་པར་མཐོང་བའམ། དངོས་པོ་དང་དངོས་པོ་མ་མཆིས་པར་མཐོང་བས་རྣམ་པར་གྲོལ་བར་ལྟ་ག་ལ་འགྱུར་ལགས།
en: Thereupon, the venerable Śāradvatī­putra asked the Blessed One as follows: “Reverend Lord, if, therefore, physical forms do not exist and they are not apprehensible, how could one be liberated by perceiving physical forms as entities, or by perceiving them as non-entities, or by perceiving them as both entities and non-entities!

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་དང་།
en: The same goes for feelings, perceptions, formative predispositions, and consciousness.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། ཆོས་རྣམས་ཀྱི་བར་དང་།
en: Likewise the same goes for sights, and, in the same vein, [the other sense objects], up to and including mental phenomena.

source: དེ་བཞིན་དུ་རྣམ་པར་ཐར་པའི་སྒོ་རྣམས་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་།
en: Likewise, the same goes for the gateways to liberation and, in the same vein, [all the other attainments], up to and including the emptiness of the essential nature of non-entities.

source: དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དང་།
en: Likewise, the same goes for the powers of the tathāgatas, and in the same vein, [all the other fruitional attributes and attainments], up to and including omniscience.

source: དེ་བཞིན་དུ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུའི་བར་དག་མ་མཆིས་ཤིང་མི་དམིགས་ལགས་ན།
en: Likewise, the same goes for the six transcendent perfections and, in the same vein, [all the other fruitional attributes], up to and including the eighty minor marks.

source: དེ་དག་དངོས་པོར་མཐོང་བའམ། དངོས་པོ་མ་མཆིས་པར་མཐོང་བའམ། དངོས་པོ་དང་དངོས་པོ་མ་མཆིས་པར་མཐོང་བས་རྣམ་པར་གྲོལ་བར་ལྟ་ག་ལ་འགྱུར་ལགས།
en: “If these do not exist and are not apprehensible, how could one be liberated by perceiving them as entities, or by perceiving them as non-entities, or by perceiving them as both entities and non-entities?

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཙུན་པ་བཅོམ་ལྡན་འདས་འདི་ལྟར་ཉོན་མོངས་པ་ནི་མཚན་མ་ལགས་པའི་སླད་དུའོ། །མཚན་མ་གང་ལགས་ཞེ་ན། གཟུགས་དང་།
en: If one were to ask why, Reverend Lord, it is because afflicted mental states would be indicated.

source: སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་བྱ་དང་། ཆོས་རྣམས་ནི་མཚན་མ་ལགས་ཏེ།
en: If one were to ask what those indications would be, the indications [of those afflicted mental states] would comprise sights, sounds, odors, tastes, tangibles, and mental phenomena.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཉོན་མོངས་པ་གང་ལགས་པ་དེ་ནི་རྣམ་པར་མི་གྲོལ་ལགས་སོ། །
en: Reverend Lord, whatever is subject to afflicted mental states is not liberated.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་ལེགས་སོ་ལེགས་སོ། །
en: The Blessed One then replied, “Śāradvatī­putra, well done, well done!

source: ཁྱོད་ཀྱིས་ཚིག་དེ་ནི་ལེགས་པར་སྨྲས་སོ། །
en: You have spoken well!

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་དེ་ལྟར་བསླབ་པར་བྱའོ། །
en: Śāradvatī­putra, that is how great bodhisattva beings should train in the transcendent perfection of wisdom.”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁྲི་པ་ལས་མངོན་པར་ཞེན་པ་མེད་པའི་ལེའུ་ཞེས་བྱ་སྟེ། གསུམ་པའོ།། །།
en: This completes the third chapter from “The Transcendent Perfection of Wisdom in Ten Thousand Lines,” entitled “Non-fixation.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཇི་ལྟར་མངོན་པར་མ་ཞེན་པར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་པར་བགྱི་ལགས། དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: Union Chapter 4 Then, the venerable Śāradvatī­putra asked the Blessed One, “Reverend Lord, how do great bodhisattva beings engage in union with the transcendent perfection of wisdom without fixation?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཟུགས་ཀྱི་སྟོང་པ་ཉིད་ལ་བརྩོན་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་ཞེས་བྱའོ། །དེ་བཞིན་དུ་ཚོར་བའི་སྟོང་པ་ཉིད་དང་། འདུ་ཤེས་ཀྱི་སྟོང་པ་ཉིད་དང་། འདུ་བྱེད་ཀྱི་སྟོང་པ་ཉིད་དང་། རྣམ་པར་ཤེས་པའི་སྟོང་པ་ཉིད་ལ་བརྩོན་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་ཞེས་བྱའོ། །
en: The Blessed One replied to the venerable Śāradvatī­putra as follows: “Śāradvatī­putra, when great bodhisattva beings engage in union with the emptiness of physical forms they are said to engage in union with the transcendent perfection of wisdom; and likewise, when they engage in union with the emptiness of feelings, the emptiness of perceptions, the emptiness of formative predispositions, and the emptiness of consciousness, they are said to engage in union with the transcendent perfection of wisdom.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མིག་གི་སྟོང་པ་ཉིད་ལ་བརྩོན་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་ཞེས་བྱའོ།།དེ་བཞིན་དུ་རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་ཡིད་ཀྱི་སྟོང་པ་ཉིད་ལ་བརྩོན་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་ཞེས་བྱའོ། །དེ་བཞིན་དུ་གཟུགས་ཀྱི་སྟོང་པ་ཉིད་ལ་བརྩོན་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་ཞེས་བྱའོ། །
en: “Moreover, Śāradvatī­putra, when great bodhisattva beings engage in union with the emptiness of the eyes, they are said to engage in union with the transcendent perfection of wisdom; and likewise, when they engage in union with the emptiness of the ears, nose, tongue, body, and mental faculty, they are said to engage in union with the transcendent perfection of wisdom.

source: དེ་བཞིན་དུ་སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་བྱ་དང་། ཆོས་ཀྱི་སྟོང་པ་ཉིད་ལ་བརྩོན་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་ཞེས་བྱའོ། །དེ་བཞིན་དུ་མིག་གི་ཁམས་ཀྱི་སྟོང་པ་ཉིད་ལ་བརྩོན་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་ཞེས་བྱའོ། །
en: “Similarly, when they engage in union with the emptiness of sights, they are said to engage in union with the transcendent perfection of wisdom; and likewise, when they engage in union with the emptiness of sounds, odors, tastes, tangibles, and mental phenomena, they are said to engage in union with the transcendent perfection of wisdom.

source: དེ་བཞིན་དུ་གཟུགས་ཀྱི་ཁམས་དང་། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་སྟོང་པ་ཉིད་དང་། རྣ་བའི་ཁམས་དང་། སྒྲའི་ཁམས་དང་། རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་སྟོང་པ་ཉིད་དང་། སྣའི་ཁམས་དང་། དྲིའི་ཁམས་དང་། སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་སྟོང་པ་ཉིད་དང་། ལྕེའི་ཁམས་དང་། རོའི་ཁམས་དང་། ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་སྟོང་པ་ཉིད་དང་། ལུས་ཀྱི་ཁམས་དང་རེག་བྱའི་ཁམས་དང་ལུས་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་སྟོང་པ་ཉིད་དང་། ཡིད་ཀྱི་ཁམས་དང་། ཆོས་ཀྱི་ཁམས་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་སྟོང་པ་ཉིད་ལ་བརྩོན་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་ཞེས་བྱའོ། །
en: “Similarly, when they engage in union with the emptiness of the sensory element of the eyes, they are said to engage in union with the transcendent perfection of wisdom; and likewise, when they engage in union with the emptiness of the sensory element of sights, and the sensory element of visual consciousness; or with the emptiness of the sensory element of the ears, the sensory element of sounds, and the sensory element of auditory consciousness; or with the emptiness of the sensory element of the nose, the sensory element of odors, and the sensory element of olfactory consciousness; or with the emptiness of the sensory element of the tongue, the sensory element of tastes, and the sensory element of gustatory consciousness; or with the emptiness of the sensory element of the body, the sensory element of tangibles, and the sensory element of tactile consciousness; or with the emptiness of the sensory element of the mental faculty, the sensory element of mental phenomena, and the sensory element of mental consciousness—[in the case of all these sensory elements], they are said to engage in union with the transcendent perfection of wisdom.

source: དེ་བཞིན་དུ་སྡུག་བསྔལ་གྱི་སྟོང་པ་ཉིད་ལ་བརྩོན་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་ཞེས་བྱའོ། །དེ་བཞིན་དུ་ཀུན་འབྱུང་བའི་སྟོང་པ་ཉིད་དང་། འགོག་པའི་སྟོང་པ་ཉིད་དང་། ལམ་གྱི་སྟོང་པ་ཉིད་ལ་བརྩོན་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་ཞེས་བྱའོ། །དེ་བཞིན་དུ་མ་རིག་པའི་སྟོང་པ་ཉིད་ལ་བརྩོན་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་ཞེས་བྱའོ། །དེ་བཞིན་དུ་འདུ་བྱེད་ཀྱི་སྟོང་པ་ཉིད་དང་། རྣམ་པར་ཤེས་པའི་སྟོང་པ་ཉིད་དང་།
en: “Similarly, when they engage in union with emptiness of suffering, they are said to engage in union with the transcendent perfection of wisdom; and likewise, when they engage in union with the emptiness of the origin of suffering, the emptiness of the cessation of suffering, and the emptiness of the path that leads to the cessation of suffering, they are said to engage in union with the transcendent perfection of wisdom.

source: མིང་དང་གཟུགས་ཀྱི་སྟོང་པ་ཉིད་དང་། སྐྱེ་མཆེད་དྲུག་གི་སྟོང་པ་ཉིད་དང་། རེག་པའི་སྟོང་པ་ཉིད་དང་། ཚོར་བའི་སྟོང་པ་ཉིད་དང་། སྲེད་པའི་སྟོང་པ་ཉིད་དང་། ལེན་པའི་སྟོང་པ་ཉིད་དང་།
en: “Similarly, when they engage in union with the emptiness of fundamental ignorance, they are said to engage in union with the transcendent perfection of wisdom; and likewise, when they engage in union with the emptiness of formative predispositions, the emptiness of consciousness, the emptiness of name and form, the emptiness of the sense fields, the emptiness of sensory contact, the emptiness of sensation, the emptiness of craving, the emptiness of grasping, the emptiness of the rebirth process, the emptiness of actual birth, and the emptiness of aging and death—[in the case of all these links of dependent origination], they are said to engage in union with the transcendent perfection of wisdom.

source: སྲིད་པའི་སྟོང་པ་ཉིད་དང་། སྐྱེ་བའི་སྟོང་པ་ཉིད་དང་། རྒ་ཤིའི་སྟོང་པ་ཉིད་ལ་བརྩོན་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་ཞེས་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་ཅིང་སྟོང་པ་ཉིད་དེ་དག་ལ་བརྩོན་པ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་ཞེས་བྱའོ། །
en: “Śāradvatī­putra, great bodhisattva beings who practice the transcendent perfection of wisdom accordingly and engage in union with the [aspects of] emptiness are said to engage in union with the transcendent perfection of wisdom.

source: སྟོང་པ་ཉིད་དེ་དག་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་པ་དེ་ནི་གཟུགས་ལ་བརྩོན་ཞེས་བྱ་བའམ། མི་བརྩོན་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ལ་བརྩོན་ཞེས་བྱ་བའམ། མི་བརྩོན་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: “Those who engage in union with the transcendent perfection of wisdom through the [aforementioned aspects of] emptiness do not consider whether or not they engage in union with physical forms, and likewise, they do not consider whether or not they engage in union with feelings, perceptions, formative predispositions, and consciousness.

source: དེ་བཞིན་དུ་མིག་ལ་བརྩོན་ཞེས་བྱ་བའམ། མི་བརྩོན་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །དེ་བཞིན་དུ་རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ལ་བརྩོན་ཞེས་བྱ་བའམ། མི་བརྩོན་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །དེ་བཞིན་དུ་གཟུགས་རྣམས་ལ་བརྩོན་ཞེས་བྱ་བའམ། མི་བརྩོན་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: “Similarly, they do not consider whether or not they engage in union with the eyes, and likewise they do not consider whether or not they engage in union with the ears, nose, tongue, body, and the mental faculty.

source: དེ་བཞིན་དུ་སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་བྱ་དང་། ཆོས་རྣམས་ལ་བརྩོན་ཞེས་བྱ་བའམ། མི་བརྩོན་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །དེ་བཞིན་དུ་མིག་གི་ཁམས་ལ་བརྩོན་ཞེས་བྱ་བའམ། མི་བརྩོན་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །དེ་བཞིན་དུ་མིག་གི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་།
en: “Similarly, they do not consider whether or not they engage in union with sights; and likewise, they do not consider whether or not they engage in union with sounds, odors, tastes, tangibles, and mental phenomena.

source: མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། རྣ་བའི་ཁམས་དང་། སྒྲའི་ཁམས་དང་། རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། སྣའི་ཁམས་དང་། དྲིའི་ཁམས་དང་། སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། ལྕེའི་ཁམས་དང་། རོའི་ཁམས་དང་། ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། ལུས་ཀྱི་ཁམས་དང་། རེག་བྱའི་ཁམས་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། ཡིད་ཀྱི་ཁམས་དང་། ཆོས་ཀྱི་ཁམས་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ལ་བརྩོན་ཞེས་བྱ་བའམ། མི་བརྩོན་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: “Similarly, they do not consider whether or not they engage in union with the sensory element of the eyes; and likewise, they do not consider whether or not they engage in union with the sensory element of the eyes, the sensory element of sights and the sensory element of visual consciousness; or the sensory element of the ears, the sensory element of sounds, and the sensory element of auditory consciousness; or the sensory element of the nose, the sensory element of odors, and the sensory element of olfactory consciousness; or the sensory element of the tongue, the sensory element of tastes, and the sensory element of gustatory consciousness; or the sensory element of the body, the sensory element of tangibles, and the sensory element of tactile consciousness; or the sensory element of the mental faculty, the sensory element of mental phenomena, and the sensory element of mental consciousness.

source: དེ་བཞིན་དུ་སྡུག་བསྔལ་ལ་བརྩོན་ཞེས་བྱ་བའམ། མི་བརྩོན་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །དེ་བཞིན་དུ་ཀུན་འབྱུང་བ་དང་། འགོག་པ་དང་། ལམ་ལ་བརྩོན་ཞེས་བྱ་བའམ། མི་བརྩོན་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །དེ་བཞིན་དུ་མ་རིག་པ་ལ་བརྩོན་ཞེས་བྱ་བའམ། མི་བརྩོན་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །དེ་བཞིན་དུ་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་དང་།
en: “Similarly, they do not consider whether or not they engage in union with suffering; and likewise, they do not consider whether or not they engage in union with the origin of suffering, the cessation of suffering, and the path leading to the cessation of suffering.

source: མིང་དང་གཟུགས་དང་། སྐྱེ་མཆེད་དྲུག་དང་། རེག་པ་དང་། ཚོར་བ་དང་། སྲེད་པ་དང་། ལེན་པ་དང་། སྲིད་པ་དང་། སྐྱེ་བ་དང་། རྒ་ཤི་ལ་བརྩོན་ཞེས་བྱ་བའམ། མི་བརྩོན་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: “Similarly, they do not consider whether or not they engage in union with fundamental ignorance, and likewise they do not consider whether or not they engage in union with formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, rebirth process, actual birth, and aging and death.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་བརྩོན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་ཞེས་བྱའོ། །
en: “Śāradvatī­putra, when great bodhisattva beings engage in union accordingly, they are said to engage in union with the transcendent perfection of wisdom.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་པ་ནི་གཟུགས་རྟག་ཅེས་བྱ་བའམ། མི་རྟག་ཅེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་རྟག་ཅེས་བྱ་བའམ། མི་རྟག་ཅེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །གཟུགས་བདེ་ཞེས་བྱ་བའམ། སྡུག་བསྔལ་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: “Moreover, Śāradvatī­putra, great bodhisattva beings who engage in union with the transcendent perfection of wisdom do not consider whether physical forms are permanent or impermanent; likewise, they do not consider whether feelings, perceptions, formative predispositions, and consciousness are permanent or impermanent.
